# SetVCenter

## Description
Procedure SetVCenter sets the VectorWorks document view center.

```pascal
PROCEDURE SetVCenter(viewCenterX,viewCenterY : REAL);
```

```python
def vs.SetVCenter(viewCenter):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewCenter|REAL|Coordinates of document view center.|

## Examples
==== VectorScript ====
```pascal
SetVCenter(2,4);
```
==== Python ====
```python

```

## Version
Availability: from MiniCAD6.0

## Category
* View @ Zoom